### Terraform CI Summary

**Format & Style:** ✅ `success`  
**Initialization:** ✅ `success`  
**Validation:** ✅ `success`  
**Plan:** ✅ `success`  

<details>
<summary>Show Terraform Plan</summary>

```
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Read complete after 0s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Read complete after 0s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Read complete after 0s[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Read complete after 0s [id=229419124][0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Read complete after 0s [id=203405526][0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Read complete after 1s [id=237686054][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # aws_route53_record.api_ipv4[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "api_ipv4" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "api.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.api_ipv6[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "api_ipv6" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "api.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "AAAA"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.lb_ipv4[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "lb_ipv4" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "lb.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.lb_ipv6[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "lb_ipv6" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "lb.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "AAAA"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.rancher_ipv4[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "rancher_ipv4" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "rancher.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.rancher_ipv6[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "rancher_ipv6" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "rancher.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "AAAA"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # module.kube-hetzner.data.hcloud_network.k3s[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "hcloud_network" "k3s" {
      [32m+[0m[0m delete_protection        = (known after apply)
      [32m+[0m[0m expose_routes_to_vswitch = (known after apply)
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ip_range                 = (known after apply)
      [32m+[0m[0m labels                   = (known after apply)
      [32m+[0m[0m name                     = (known after apply)
    }

[1m  # module.kube-hetzner.data.remote_file.kubeconfig[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "remote_file" "kubeconfig" {
      [32m+[0m[0m content     = (known after apply)
      [32m+[0m[0m group       = (known after apply)
      [32m+[0m[0m group_name  = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m owner       = (known after apply)
      [32m+[0m[0m owner_name  = (known after apply)
      [32m+[0m[0m path        = "/etc/rancher/k3s/k3s.yaml"
      [32m+[0m[0m permissions = (known after apply)

      [32m+[0m[0m conn {
          [32m+[0m[0m agent       = (sensitive value)
          [32m+[0m[0m host        = (known after apply)
          [32m+[0m[0m port        = 22
          [32m+[0m[0m private_key = (sensitive value)
          [32m+[0m[0m user        = "root"
        }
    }

[1m  # module.kube-hetzner.hcloud_firewall.k3s[0m will be created
[0m  [32m+[0m[0m resource "hcloud_firewall" "k3s" {
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m labels = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
        }
      [32m+[0m[0m name   = "kube-baphomet"

      [32m+[0m[0m rule {
          [32m+[0m[0m description     = "Allow Incoming ICMP Ping Requests"
          [32m+[0m[0m destination_ips = []
          [32m+[0m[0m direction       = "in"
          [32m+[0m[0m protocol        = "icmp"
          [32m+[0m[0m source_ips      = [
              [32m+[0m[0m "0.0.0.0/0",
              [32m+[0m[0m "::/0",
            ]
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
      [32m+[0m[0m rule {
          [32m+[0m[0m description     = "Allow Incoming Requests to Kube API Server"
          [32m+[0m[0m destination_ips = []
          [32m+[0m[0m direction       = "in"
          [32m+[0m[0m port            = "6443"
          [32m+[0m[0m protocol        = "tcp"
          [32m+[0m[0m source_ips      = [
              [32m+[0m[0m "0.0.0.0/0",
              [32m+[0m[0m "::/0",
            ]
        }
      [32m+[0m[0m rule {
          [32m+[0m[0m description     = "Allow Incoming SSH Traffic"
          [32m+[0m[0m destination_ips = []
          [32m+[0m[0m direction       = "in"
          [32m+[0m[0m port            = "22"
          [32m+[0m[0m protocol        = "tcp"
          [32m+[0m[0m source_ips      = [
              [32m+[0m[0m "0.0.0.0/0",
              [32m+[0m[0m "::/0",
            ]
        }
    }

[1m  # module.kube-hetzner.hcloud_load_balancer.cluster[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_load_balancer" "cluster" {
      [32m+[0m[0m delete_protection  = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m ipv4               = (known after apply)
      [32m+[0m[0m ipv6               = (known after apply)
      [32m+[0m[0m labels             = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
        }
      [32m+[0m[0m load_balancer_type = "lb11"
      [32m+[0m[0m location           = "fsn1"
      [32m+[0m[0m name               = "kube-baphomet-nginx"
      [32m+[0m[0m network_id         = (known after apply)
      [32m+[0m[0m network_ip         = (known after apply)
      [32m+[0m[0m network_zone       = (known after apply)

      [32m+[0m[0m algorithm {
          [32m+[0m[0m type = "round_robin"
        }

      [32m+[0m[0m target (known after apply)
    }

[1m  # module.kube-hetzner.hcloud_network.k3s[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_network" "k3s" {
      [32m+[0m[0m delete_protection        = false
      [32m+[0m[0m expose_routes_to_vswitch = false
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ip_range                 = "10.0.0.0/8"
      [32m+[0m[0m labels                   = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
        }
      [32m+[0m[0m name                     = "kube-baphomet"
    }

[1m  # module.kube-hetzner.hcloud_network_subnet.agent[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_network_subnet" "agent" {
      [32m+[0m[0m gateway      = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_range     = "10.0.0.0/16"
      [32m+[0m[0m network_id   = (known after apply)
      [32m+[0m[0m network_zone = "eu-central"
      [32m+[0m[0m type         = "cloud"
    }

[1m  # module.kube-hetzner.hcloud_network_subnet.agent[1][0m will be created
[0m  [32m+[0m[0m resource "hcloud_network_subnet" "agent" {
      [32m+[0m[0m gateway      = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_range     = "10.1.0.0/16"
      [32m+[0m[0m network_id   = (known after apply)
      [32m+[0m[0m network_zone = "eu-central"
      [32m+[0m[0m type         = "cloud"
    }

[1m  # module.kube-hetzner.hcloud_network_subnet.agent[2][0m will be created
[0m  [32m+[0m[0m resource "hcloud_network_subnet" "agent" {
      [32m+[0m[0m gateway      = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_range     = "10.2.0.0/16"
      [32m+[0m[0m network_id   = (known after apply)
      [32m+[0m[0m network_zone = "eu-central"
      [32m+[0m[0m type         = "cloud"
    }

[1m  # module.kube-hetzner.hcloud_network_subnet.control_plane[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_network_subnet" "control_plane" {
      [32m+[0m[0m gateway      = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_range     = "10.255.0.0/16"
      [32m+[0m[0m network_id   = (known after apply)
      [32m+[0m[0m network_zone = "eu-central"
      [32m+[0m[0m type         = "cloud"
    }

[1m  # module.kube-hetzner.hcloud_network_subnet.control_plane[1][0m will be created
[0m  [32m+[0m[0m resource "hcloud_network_subnet" "control_plane" {
      [32m+[0m[0m gateway      = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_range     = "10.254.0.0/16"
      [32m+[0m[0m network_id   = (known after apply)
      [32m+[0m[0m network_zone = "eu-central"
      [32m+[0m[0m type         = "cloud"
    }

[1m  # module.kube-hetzner.hcloud_network_subnet.control_plane[2][0m will be created
[0m  [32m+[0m[0m resource "hcloud_network_subnet" "control_plane" {
      [32m+[0m[0m gateway      = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_range     = "10.253.0.0/16"
      [32m+[0m[0m network_id   = (known after apply)
      [32m+[0m[0m network_zone = "eu-central"
      [32m+[0m[0m type         = "cloud"
    }

[1m  # module.kube-hetzner.hcloud_placement_group.agent[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_placement_group" "agent" {
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m labels  = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
        }
      [32m+[0m[0m name    = "kube-baphomet-agent-1"
      [32m+[0m[0m servers = (known after apply)
      [32m+[0m[0m type    = "spread"
    }

[1m  # module.kube-hetzner.hcloud_placement_group.control_plane[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_placement_group" "control_plane" {
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m labels  = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
        }
      [32m+[0m[0m name    = "kube-baphomet-control-plane-1"
      [32m+[0m[0m servers = (known after apply)
      [32m+[0m[0m type    = "spread"
    }

[1m  # module.kube-hetzner.hcloud_ssh_key.k3s[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_ssh_key" "k3s" {
      [32m+[0m[0m fingerprint = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m labels      = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
        }
      [32m+[0m[0m name        = "kube-baphomet"
      [32m+[0m[0m public_key  = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDM6+/y/tv38oxmx8PPUPCljLm5o/Q8ROFOtddjwGaZq sandro@sandros-MBP.telekom.ip"
    }

[1m  # module.kube-hetzner.local_file.kustomization_backup[0][0m will be created
[0m  [32m+[0m[0m resource "local_file" "kustomization_backup" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0777"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kustomization_backup.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.local_sensitive_file.kubeconfig[0][0m will be created
[0m  [32m+[0m[0m resource "local_sensitive_file" "kubeconfig" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0700"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kubeconfig.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.null_resource.agent_config["0-0-worker-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agent_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
          [32m+[0m[0m "config"   = (sensitive value)
        }
    }

[1m  # module.kube-hetzner.null_resource.agent_config["1-0-worker-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agent_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
          [32m+[0m[0m "config"   = (sensitive value)
        }
    }

[1m  # module.kube-hetzner.null_resource.agent_config["2-0-worker-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agent_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
          [32m+[0m[0m "config"   = (sensitive value)
        }
    }

[1m  # module.kube-hetzner.null_resource.agents["0-0-worker-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agents" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.agents["1-0-worker-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agents" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.agents["2-0-worker-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agents" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.authentication_config["0-0-control-plane-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "authentication_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
          [32m+[0m[0m "control_plane_id"      = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.authentication_config["1-0-control-plane-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "authentication_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
          [32m+[0m[0m "control_plane_id"      = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.authentication_config["2-0-control-plane-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "authentication_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
          [32m+[0m[0m "control_plane_id"      = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_plane_config["0-0-control-plane-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_plane_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "config"           = (sensitive value)
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_plane_config["1-0-control-plane-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_plane_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "config"           = (sensitive value)
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_plane_config["2-0-control-plane-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_plane_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "config"           = (sensitive value)
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_planes["0-0-control-plane-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_planes" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_planes["1-0-control-plane-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_planes" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_planes["2-0-control-plane-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_planes" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.first_control_plane[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "first_control_plane" {
      [32m+[0m[0m id = (known after apply)
    }

[1m  # module.kube-hetzner.null_resource.kustomization[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "kustomization" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "helm_values_yaml" = (sensitive value)
          [32m+[0m[0m "options"          = <<-EOT
                period=5m
                post-reboot-node-labels=kured=done
                pre-reboot-node-labels=kured=rebooting
                reboot-command=/usr/bin/systemctl reboot
                reboot-sentinel=/sentinel/reboot-required
            EOT
          [32m+[0m[0m "versions"         = <<-EOT
                v1.30
                N/A
                v1.30.3
                N/A
                N/A
                N/A
                N/A
                1.15.1
                N/A
                N/A
                N/A
            EOT
        }
    }

[1m  # module.kube-hetzner.random_password.k3s_token[0m will be created
[0m  [32m+[0m[0m resource "random_password" "k3s_token" {
      [32m+[0m[0m bcrypt_hash = (sensitive value)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 48
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (sensitive value)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = true
    }

[1m  # module.kube-hetzner.random_password.rancher_bootstrap[0][0m will be created
[0m  [32m+[0m[0m resource "random_password" "rancher_bootstrap" {
      [32m+[0m[0m bcrypt_hash = (sensitive value)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 48
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (sensitive value)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = true
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].data.cloudinit_config.config[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = (known after apply)
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].hcloud_rdns.server[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "311967250"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
          [32m+[0m[0m "role"        = "agent_node"
        }
      [32m+[0m[0m location                   = "hel1"
      [32m+[0m[0m name                       = (known after apply)
      [32m+[0m[0m placement_group_id         = (known after apply)
      [32m+[0m[0m primary_disk_size          = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cx22"
      [32m+[0m[0m shutdown_before_deletion   = false
      [32m+[0m[0m ssh_keys                   = (known after apply)
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server_network.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server_network" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m ip          = "10.0.0.101"
      [32m+[0m[0m mac_address = (known after apply)
      [32m+[0m[0m server_id   = (known after apply)
      [32m+[0m[0m subnet_id   = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].random_string.identity_file[0m will be created
[0m  [32m+[0m[0m resource "random_string" "identity_file" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 20
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].random_string.server[0m will be created
[0m  [32m+[0m[0m resource "random_string" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m keepers     = {
          [32m+[0m[0m "name" = "kube-baphomet-worker-0"
        }
      [32m+[0m[0m length      = 3
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = false
      [32m+[0m[0m numeric     = false
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].data.cloudinit_config.config[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = (known after apply)
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].hcloud_rdns.server[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].hcloud_server.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "311967250"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
          [32m+[0m[0m "role"        = "agent_node"
        }
      [32m+[0m[0m location                   = "nbg1"
      [32m+[0m[0m name                       = (known after apply)
      [32m+[0m[0m placement_group_id         = (known after apply)
      [32m+[0m[0m primary_disk_size          = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cx32"
      [32m+[0m[0m shutdown_before_deletion   = false
      [32m+[0m[0m ssh_keys                   = (known after apply)
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].hcloud_server_network.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server_network" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m ip          = "10.1.0.101"
      [32m+[0m[0m mac_address = (known after apply)
      [32m+[0m[0m server_id   = (known after apply)
      [32m+[0m[0m subnet_id   = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].random_string.identity_file[0m will be created
[0m  [32m+[0m[0m resource "random_string" "identity_file" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 20
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].random_string.server[0m will be created
[0m  [32m+[0m[0m resource "random_string" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m keepers     = {
          [32m+[0m[0m "name" = "kube-baphomet-worker-1"
        }
      [32m+[0m[0m length      = 3
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = false
      [32m+[0m[0m numeric     = false
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].data.cloudinit_config.config[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = (known after apply)
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].hcloud_rdns.server[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "311967250"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
          [32m+[0m[0m "role"        = "agent_node"
        }
      [32m+[0m[0m location                   = "fsn1"
      [32m+[0m[0m name                       = (known after apply)
      [32m+[0m[0m placement_group_id         = (known after apply)
      [32m+[0m[0m primary_disk_size          = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cx32"
      [32m+[0m[0m shutdown_before_deletion   = false
      [32m+[0m[0m ssh_keys                   = (known after apply)
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server_network.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server_network" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m ip          = "10.2.0.101"
      [32m+[0m[0m mac_address = (known after apply)
      [32m+[0m[0m server_id   = (known after apply)
      [32m+[0m[0m subnet_id   = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].random_string.identity_file[0m will be created
[0m  [32m+[0m[0m resource "random_string" "identity_file" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 20
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].random_string.server[0m will be created
[0m  [32m+[0m[0m resource "random_string" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m keepers     = {
          [32m+[0m[0m "name" = "kube-baphomet-worker-2"
        }
      [32m+[0m[0m length      = 3
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = false
      [32m+[0m[0m numeric     = false
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].data.cloudinit_config.config[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = (known after apply)
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_rdns.server[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_server.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "311967250"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
          [32m+[0m[0m "role"        = "control_plane_node"
        }
      [32m+[0m[0m location                   = "fsn1"
      [32m+[0m[0m name                       = (known after apply)
      [32m+[0m[0m placement_group_id         = (known after apply)
      [32m+[0m[0m primary_disk_size          = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cx22"
      [32m+[0m[0m shutdown_before_deletion   = false
      [32m+[0m[0m ssh_keys                   = (known after apply)
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = (known after apply)
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_server_network.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server_network" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m ip          = "10.255.0.101"
      [32m+[0m[0m mac_address = (known after apply)
      [32m+[0m[0m server_id   = (known after apply)
      [32m+[0m[0m subnet_id   = (known after apply)
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.identity_file[0m will be created
[0m  [32m+[0m[0m resource "random_string" "identity_file" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 20
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.server[0m will be created
[0m  [32m+[0m[0m resource "random_string" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m keepers     = {
          [32m+[0m[0m "name" = "kube-baphomet-control-plane-0"
        }
      [32m+[0m[0m length      = 3
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = false
      [32m+[0m[0m numeric     = false
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].data.cloudinit_config.config[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = (known after apply)
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_rdns.server[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_server.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "311967250"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
          [32m+[0m[0m "role"        = "control_plane_node"
        }
      [32m+[0m[0m location                   = "nbg1"
      [32m+[0m[0m name                       = (known after apply)
      [32m+[0m[0m placement_group_id         = (known after apply)
      [32m+[0m[0m primary_disk_size          = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cx22"
      [32m+[0m[0m shutdown_before_deletion   = false
      [32m+[0m[0m ssh_keys                   = (known after apply)
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = (known after apply)
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_server_network.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server_network" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m ip          = "10.254.0.101"
      [32m+[0m[0m mac_address = (known after apply)
      [32m+[0m[0m server_id   = (known after apply)
      [32m+[0m[0m subnet_id   = (known after apply)
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.identity_file[0m will be created
[0m  [32m+[0m[0m resource "random_string" "identity_file" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 20
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.server[0m will be created
[0m  [32m+[0m[0m resource "random_string" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m keepers     = {
          [32m+[0m[0m "name" = "kube-baphomet-control-plane-1"
        }
      [32m+[0m[0m length      = 3
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = false
      [32m+[0m[0m numeric     = false
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].data.cloudinit_config.config[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = (known after apply)
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_rdns.server[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_server.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "311967250"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
          [32m+[0m[0m "role"        = "control_plane_node"
        }
      [32m+[0m[0m location                   = "hel1"
      [32m+[0m[0m name                       = (known after apply)
      [32m+[0m[0m placement_group_id         = (known after apply)
      [32m+[0m[0m primary_disk_size          = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cx22"
      [32m+[0m[0m shutdown_before_deletion   = false
      [32m+[0m[0m ssh_keys                   = (known after apply)
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = (known after apply)
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_server_network.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server_network" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m ip          = "10.253.0.101"
      [32m+[0m[0m mac_address = (known after apply)
      [32m+[0m[0m server_id   = (known after apply)
      [32m+[0m[0m subnet_id   = (known after apply)
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.identity_file[0m will be created
[0m  [32m+[0m[0m resource "random_string" "identity_file" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 20
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.server[0m will be created
[0m  [32m+[0m[0m resource "random_string" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m keepers     = {
          [32m+[0m[0m "name" = "kube-baphomet-control-plane-2"
        }
      [32m+[0m[0m length      = 3
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = false
      [32m+[0m[0m numeric     = false
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1mPlan:[0m 81 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Pushed by @muchasxmaracas, Action: `pull_request`*